#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.statebackup.data.archive_file.workspaces: Reading...
module.statebackup.data.archive_file.lambda_layer: Reading...
module.statebackup.data.archive_file.sendreport: Reading...
module.statebackup.data.archive_file.organizations: Reading...
module.statebackup.data.archive_file.statebackup: Reading...
module.statebackup.data.archive_file.organizations: Read complete after 0s [id=766e25bd1ba6613b998edd2d96d341c885b9b337]
module.statebackup.data.archive_file.workspaces: Read complete after 0s [id=2811eb88343fb9604a644f399fad1dd2c1f573e4]
module.statebackup.data.archive_file.statebackup: Read complete after 0s [id=e7b8b063f934ab7a737f324aa690e1a714932771]
module.statebackup.data.archive_file.sendreport: Read complete after 0s [id=0748687418994257d179873e80e567d75865f0bf]
module.statebackup.data.archive_file.lambda_layer: Read complete after 0s [id=e140d02ca27650263d4ae243c41423392946b3d4]
module.statebackup.data.aws_caller_identity.current: Reading...
module.statebackup.data.aws_caller_identity.current: Read complete after 1s [id=751569595345]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.statebackup.data.aws_iam_policy_document.cw_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cw_role_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "states:StartExecution",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.statebackup.data.aws_iam_policy_document.s3 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "UploadToS3"
        }
    }

  # module.statebackup.data.aws_iam_policy_document.sns will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sns" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "PublishSNS"
        }
    }

  # module.statebackup.data.aws_iam_policy_document.step_functions_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "step_functions_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.statebackup.aws_cloudwatch_event_rule.state_backup will be created
  + resource "aws_cloudwatch_event_rule" "state_backup" {
      + arn                 = (known after apply)
      + description         = "Perform a state backup of all Terraform Cloud workspaces."
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "TerraformStateBackup-CW-EventRule"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 23 * * ? *)"
      + tags_all            = (known after apply)
    }

  # module.statebackup.aws_cloudwatch_event_target.sfn will be created
  + resource "aws_cloudwatch_event_target" "sfn" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + role_arn       = (known after apply)
      + rule           = "TerraformStateBackup-CW-EventRule"
      + target_id      = "TriggerSFN"
    }

  # module.statebackup.aws_cloudwatch_log_group.this["TerraformStateBackup-organizations-Lambda-Function"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/TerraformStateBackup-organizations-Lambda-Function"
      + retention_in_days = 30
      + tags_all          = (known after apply)
    }

  # module.statebackup.aws_cloudwatch_log_group.this["TerraformStateBackup-sendreport-Lambda-Function"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/TerraformStateBackup-sendreport-Lambda-Function"
      + retention_in_days = 30
      + tags_all          = (known after apply)
    }

  # module.statebackup.aws_cloudwatch_log_group.this["TerraformStateBackup-statebackup-Lambda-Function"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/TerraformStateBackup-statebackup-Lambda-Function"
      + retention_in_days = 30
      + tags_all          = (known after apply)
    }

  # module.statebackup.aws_cloudwatch_log_group.this["TerraformStateBackup-workspaces-Lambda-Function"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/TerraformStateBackup-workspaces-Lambda-Function"
      + retention_in_days = 30
      + tags_all          = (known after apply)
    }

  # module.statebackup.aws_iam_policy.cw_role_policy will be created
  + resource "aws_iam_policy" "cw_role_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "TerraformStateBackup-CWEvent-Policy"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.statebackup.aws_iam_policy.s3 will be created
  + resource "aws_iam_policy" "s3" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "TerraformStateBackup-Lambda-S3-Policy"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.statebackup.aws_iam_policy.sns will be created
  + resource "aws_iam_policy" "sns" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "TerraformStateBackup-Lambda-SNS-Policy"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.statebackup.aws_iam_policy.step_function_policy will be created
  + resource "aws_iam_policy" "step_function_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "TerraformStateBackup-SFN-Policy"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.statebackup.aws_iam_policy_attachment.cw_role will be created
  + resource "aws_iam_policy_attachment" "cw_role" {
      + id         = (known after apply)
      + name       = "TerraformStateBackup-CWEvent-Role-attachment"
      + policy_arn = (known after apply)
      + roles      = [
          + "TerraformStateBackup-CWEvent-Role",
        ]
    }

  # module.statebackup.aws_iam_role.cw_role will be created
  + resource "aws_iam_role" "cw_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:AssumeRole",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "states.amazonaws.com",
                              + "events.amazonaws.com",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "TerraformStateBackup-CWEvent-Role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.statebackup.aws_iam_role.step_functions_role will be created
  + resource "aws_iam_role" "step_functions_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "TerraformStateBackup-SFN-Role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.statebackup.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "TerraformStateBackup-Lambda-Role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.statebackup.aws_iam_role_policy_attachment.cw will be created
  + resource "aws_iam_role_policy_attachment" "cw" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "TerraformStateBackup-Lambda-Role"
    }

  # module.statebackup.aws_iam_role_policy_attachment.s3 will be created
  + resource "aws_iam_role_policy_attachment" "s3" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "TerraformStateBackup-Lambda-Role"
    }

  # module.statebackup.aws_iam_role_policy_attachment.sns will be created
  + resource "aws_iam_role_policy_attachment" "sns" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "TerraformStateBackup-Lambda-Role"
    }

  # module.statebackup.aws_iam_role_policy_attachment.step_functions_role_attachment will be created
  + resource "aws_iam_role_policy_attachment" "step_functions_role_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "TerraformStateBackup-SFN-Role"
    }

  # module.statebackup.aws_lambda_function.organizations will be created
  + resource "aws_lambda_function" "organizations" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Returns all Terraform Cloud organizations."
      + filename                       = "../organizations.zip"
      + function_name                  = "TerraformStateBackup-organizations-Lambda-Function"
      + handler                        = "organizations.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "vaNBA++1pTGWvCoIEay1IiFJo9O6JpPk7aW7Cz0GjMg="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 20
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "SSL_VERIFY" = "true"
              + "TFC_TOKEN"  = (sensitive)
              + "TFC_URL"    = "https://app.terraform.io"
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.statebackup.aws_lambda_function.sendreport will be created
  + resource "aws_lambda_function" "sendreport" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Sends a notification to the provided SNS topic."
      + filename                       = "../sendReport.zip"
      + function_name                  = "TerraformStateBackup-sendreport-Lambda-Function"
      + handler                        = "sendReport.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "friMH9L8vodrtjA/qUwelpMnAEX6E8HEI/dRkEVQAHE="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 20
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.statebackup.aws_lambda_function.statebackup will be created
  + resource "aws_lambda_function" "statebackup" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Uploads the current state version of a Terraform workspace to s3."
      + filename                       = "../stateBackup.zip"
      + function_name                  = "TerraformStateBackup-statebackup-Lambda-Function"
      + handler                        = "stateBackup.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "mi2z3VaOnuLKqkWRDA2KIEaU/uhemebwgpAbY5dLptQ="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 20
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "S3_BUCKET"  = "terraformstatebackup-bucket-751569595345"
              + "SSL_VERIFY" = "true"
              + "TFC_TOKEN"  = (sensitive)
              + "TFC_URL"    = "https://app.terraform.io"
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.statebackup.aws_lambda_function.workspaces will be created
  + resource "aws_lambda_function" "workspaces" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Returns all workspaces of a Terraform Cloud organization."
      + filename                       = "../workspaces.zip"
      + function_name                  = "TerraformStateBackup-workspaces-Lambda-Function"
      + handler                        = "workspaces.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "pKQxI1ir9y+ubrNGVruAkIIFRiQ29ly2SbGVdx3Kd8Y="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 20
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "SSL_VERIFY" = "true"
              + "TFC_TOKEN"  = (sensitive)
              + "TFC_URL"    = "https://app.terraform.io"
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.statebackup.aws_lambda_layer_version.lambda_layer will be created
  + resource "aws_lambda_layer_version" "lambda_layer" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "python3.9",
        ]
      + created_date                = (known after apply)
      + filename                    = "../python_packages.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "TerraformStateBackup-Lambda-Layer"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # module.statebackup.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "terraformstatebackup-bucket-751569595345"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.statebackup.aws_s3_bucket_acl.this will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.statebackup.aws_s3_bucket_lifecycle_configuration.this will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + id     = "expire"
          + status = "Enabled"

          + expiration {
              + days                         = 30
              + expired_object_delete_marker = (known after apply)
            }
        }
    }

  # module.statebackup.aws_s3_bucket_policy.this will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = "terraformstatebackup-bucket-751569595345"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.statebackup.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.statebackup.aws_s3_bucket_server_side_encryption_configuration.this will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = "terraformstatebackup-bucket-751569595345"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "aws:kms"
            }
        }
    }

  # module.statebackup.aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.statebackup.aws_sfn_state_machine.state_machine will be created
  + resource "aws_sfn_state_machine" "state_machine" {
      + arn           = (known after apply)
      + creation_date = (known after apply)
      + definition    = (known after apply)
      + id            = (known after apply)
      + name          = "TerraformStateBackup-SFN-StateMachine"
      + role_arn      = (known after apply)
      + status        = (known after apply)
      + tags_all      = (known after apply)
      + type          = "STANDARD"

      + logging_configuration {
          + include_execution_data = (known after apply)
          + level                  = (known after apply)
          + log_destination        = (known after apply)
        }

      + tracing_configuration {
          + enabled = (known after apply)
        }
    }

  # module.statebackup.aws_sns_topic.report will be created
  + resource "aws_sns_topic" "report" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = "alias/aws/sns"
      + name                        = "TerraformStateBackup-SNS-ReportTopic"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags_all                    = (known after apply)
    }

  # module.statebackup.aws_sns_topic_subscription.email["address@email.com"] will be created
  + resource "aws_sns_topic_subscription" "email" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "address@email.com"
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

Plan: 33 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Olgoetz, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*